## Imports

In [1]:
import pandas as pd
import numpy as np
import sqlalchemy as sal
from faker import Faker
from collections import defaultdict
import datetime

In [2]:
from sqlalchemy import Column
from sqlalchemy import ForeignKey
from sqlalchemy import Integer
from sqlalchemy import String
from sqlalchemy.orm import declarative_base
from sqlalchemy.orm import relationship
from sqlalchemy.orm import backref
from sqlalchemy.orm import Session
import psycopg2
from psycopg2.extensions import register_adapter, AsIs
psycopg2.extensions.register_adapter(np.int64, psycopg2._psycopg.AsIs)

## Connect to Database

In [3]:
print("Conection script started...")

USERNAME = 'julia'
PASSWORD = '1q2w3e4r'
HOST = 'localhost'
PORT = '5432'
DATABASE_NAME = 'EMPLOYEES'
engine = sal.create_engine(f'postgresql+psycopg2://{USERNAME}:{PASSWORD}@{HOST}:{PORT}/{DATABASE_NAME}')
#('postgresql+psycopg2://user:password@host:port/database_name')
conn = engine.connect()

print("Connection established")

Conection script started...
Connection established

In [4]:
print(engine.table_names())

['employee', 'employee_stats', 'project_team', 'project', 'hr_record']

C:\Users\Julia\AppData\Local\Temp\ipykernel_12648\1043810782.py:1: SADeprecationWarning: The Engine.table_names() method is deprecated and will be removed in a future release.  Please refer to Inspector.get_table_names(). (deprecated since: 1.4)
  print(engine.table_names())

## Define database classes for sqlalchemy

In [5]:
Base = declarative_base()

class Employee(Base):
    __tablename__ = "employee"

    id = Column(Integer, primary_key=True)
    birthday = Column(String)
    gender = Column(String)
    city_name = Column(String)
    department_name = Column(String)
    job_title = Column(String)
    store_name = Column(String)
    business_unit = Column(String)

    def __repr__(self):
        return f"Employee(id={self.id!r}, birthday={self.birthday!r}, \
                    gender={self.gender!r}, city_name={self.city_name!r}, \
                    department_name={self.department_name!r}, job_title={self.job_title!r}, \
                    store_name={self.store_name!r}, business_unit={self.business_unit!r})"

class Project(Base):
    __tablename__ = "project"

    id = Column(Integer, primary_key=True)
    name = Column(String)
    start_date = Column(sal.Date)
    end_date = Column(sal.Date)

    def __repr__(self):
        return f"Project(id={self.id!r}, name={self.name!r}, \
                    start_date={self.start_date!r}, end_date={self.end_date!r})"

class HRRecord(Base):
    __tablename__ = "hr_record"
    # one-to-one Parent.child
    #child = relationship("EmployeeStats", back_populates="hr_record", uselist=False)
    #employee = relationship("Employee", backref=backref("hr_record", uselist=False), primaryjoin="hr_record.employee_id==employee.id")

    id = Column(Integer, primary_key=True)
    record_date = Column(sal.Date)
    employee_id = Column(Integer) #, ForeignKey("Employee.id"))
    orighire_date = Column(sal.Date)
    termination_date = Column(sal.Date)
    termreason_desc = Column(String)
    status = Column(String)

    def __repr__(self):
        return f"HRRecord(id={self.id!r}, record_date={self.record_date!r},  \
                employee_id={self.employee_id!r}, orighire_date={self.orighire_date!r}, \
                termination_date={self.termination_date!r}, termreason_desc={self.termreason_desc!r})"

class EmployeeStats(Base):
    __tablename__ = "employee_stats"
    #parent = relationship("HRRecord", back_populates="employee_stats")
    #hr_record = relationship("HRRecord", backref=backref("employee_stats", uselist=False), primaryjoin="EmployeeStats.record_id==HRRecord.id")
    #employee = relationship("Employee", backref=backref("employee_stats"), primaryjoin="EmployeeStats.employee_id==employee.id")

    id = Column(Integer, primary_key=True)
    record_id = Column(Integer) #, ForeignKey("HRRecord.id"))
    employee_id = Column(Integer) #, ForeignKey("Employee.id"))
    age = Column(Integer)
    length_of_service = Column(Integer)

    def __repr__(self):
        return f"EmployeeStats(id={self.id!r}, record_id={self.record_id!r}, \
                employee_id={self.employee_id!r}, age={self.age!r}, \
                length_of_service={self.length_of_service!r})"

class ProjectTeam(Base):
    __tablename__ = "project_team"

    project_id = Column(Integer, primary_key=True) #, ForeignKey("Project.id"), primary_key=True,)
    employee_id = Column(String) #,  ForeignKey("Employee.id"), nullable=False,)

    def __repr__(self):
        return f"ProjectTeam(project_id={self.project_id!r}, employee_id={self.employee_id!r})"

## Create test data

In [18]:
# We will use ready kaggle dataset
data_df = pd.read_csv("./data/MFG10YearTerminationData.csv")

In [7]:
data_df

,EmployeeID,recorddate_key,birthdate_key,orighiredate_key,terminationdate_key,age,length_of_service,city_name,department_name,job_title,store_name,gender_short,gender_full,termreason_desc,termtype_desc,STATUS_YEAR,STATUS,BUSINESS_UNIT
0,1318,12/31/2006 0:00,1/3/1954,8/28/1989,1/1/1900,52,17,Vancouver,Executive,CEO,35,M,Male,Not Applicable,Not Applicable,2006,ACTIVE,HEADOFFICE
1,1318,12/31/2007 0:00,1/3/1954,8/28/1989,1/1/1900,53,18,Vancouver,Executive,CEO,35,M,Male,Not Applicable,Not Applicable,2007,ACTIVE,HEADOFFICE
2,1318,12/31/2008 0:00,1/3/1954,8/28/1989,1/1/1900,54,19,Vancouver,Executive,CEO,35,M,Male,Not Applicable,Not Applicable,2008,ACTIVE,HEADOFFICE
3,1318,12/31/2009 0:00,1/3/1954,8/28/1989,1/1/1900,55,20,Vancouver,Executive,CEO,35,M,Male,Not Applicable,Not Applicable,2009,ACTIVE,HEADOFFICE
4,1318,12/31/2010 0:00,1/3/1954,8/28/1989,1/1/1900,56,21,Vancouver,Executive,CEO,35,M,Male,Not Applicable,Not Applicable,2010,ACTIVE,HEADOFFICE
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
49648,8258,12/1/2015 0:00,5/28/1994,8/19/2013,12/30/2015,21,2,Valemount,Dairy,Dairy Person,34,M,Male,Layoff,Involuntary,2015,TERMINATED,STORES
49649,8264,8/1/2013 0:00,6/13/1994,8/27/2013,8/30/2013,19,0,Vancouver,Customer Service,Cashier,44,F,Female,Resignaton,Voluntary,2013,TERMINATED,STORES
49650,8279,12/1/2015 0:00,7/18/1994,9/15/2013,12/30/2015,21,2,White Rock,Customer Service,Cashier,39,F,Female,Layoff,Involuntary,2015,TERMINATED,STORES
49651,8296,12/1/2013 0:00,9/2/1994,10/9/2013,12/31/2013,19,0,Kelowna,Customer Service,Cashier,16,F,Female,Resignaton,Voluntary,2013,TERMINATED,STORES
49652,8321,12/1/2014 0:00,11/28/1994,11/24/2013,12/30/2014,20,1,Grand Forks,Customer Service,Cashier,13,F,Female,Layoff,Involuntary,2014,TERMINATED,STORES

In [19]:
# Convert data to needed format
data_df['birthdate_key'] = pd.to_datetime(data_df['birthdate_key'], format='%m/%d/%Y')
data_df['orighiredate_key'] = pd.to_datetime(data_df['orighiredate_key'], format='%m/%d/%Y')
data_df['terminationdate_key'] = pd.to_datetime(data_df['terminationdate_key'], format='%m/%d/%Y')

recorddate  = [d[:-5] for d in data_df['recorddate_key']]
data_df['recorddate_key'] = pd.to_datetime(recorddate, format='%m/%d/%Y')

In [20]:
data_df[:2]

,EmployeeID,recorddate_key,birthdate_key,orighiredate_key,terminationdate_key,age,length_of_service,city_name,department_name,job_title,store_name,gender_short,gender_full,termreason_desc,termtype_desc,STATUS_YEAR,STATUS,BUSINESS_UNIT
0,1318,2006-12-31,1954-01-03,1989-08-28,1900-01-01,52,17,Vancouver,Executive,CEO,35,M,Male,Not Applicable,Not Applicable,2006,ACTIVE,HEADOFFICE
1,1318,2007-12-31,1954-01-03,1989-08-28,1900-01-01,53,18,Vancouver,Executive,CEO,35,M,Male,Not Applicable,Not Applicable,2007,ACTIVE,HEADOFFICE

In [21]:
data_df2 =  data_df.append([data_df]*20, ignore_index=True)
data_df2 ['EmployeeID'] = data_df2.index

C:\Users\Julia\AppData\Local\Temp\ipykernel_12648\3307131577.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  data_df2 =  data_df.append([data_df]*20, ignore_index=True)

We can fill the database right from dataset:  
1. employee table   
2. hr_record table  
3. employee_stats table after hr_record  
4. generate fake data for project table and fill it
5. project_team table

In [22]:
# employee table
df_test_employee = data_df2.copy()
df_test_employee = df_test_employee[['EmployeeID', 'birthdate_key', 'gender_short', 
                            'city_name',	'department_name', 'job_title',	
                            'store_name', 'BUSINESS_UNIT']]
df_test_employee.drop_duplicates(subset=['EmployeeID'], inplace=True)

dbnames = {'EmployeeID' : 'id', 'birthdate_key' : 'birthday', 
            'gender_short' : 'gender', 'BUSINESS_UNIT' : 'business_unit'}
df_test_employee.rename(columns=dbnames, inplace=True)

In [23]:
df_test_employee[:2]

,id,birthday,gender,city_name,department_name,job_title,store_name,business_unit
0,0,1954-01-03,M,Vancouver,Executive,CEO,35,HEADOFFICE
1,1,1954-01-03,M,Vancouver,Executive,CEO,35,HEADOFFICE

In [13]:
#del df_test_employee['id']

In [24]:
# Fill the table
df_test_employee.to_sql("employee", con=engine, index=False, if_exists='append')

713

In [29]:
data_df[:2]

,EmployeeID,recorddate_key,birthdate_key,orighiredate_key,terminationdate_key,age,length_of_service,city_name,department_name,job_title,store_name,gender_short,gender_full,termreason_desc,termtype_desc,STATUS_YEAR,STATUS,BUSINESS_UNIT
0,1318,2006-12-31,1954-01-03,1989-08-28,1900-01-01,52,17,Vancouver,Executive,CEO,35,M,Male,Not Applicable,Not Applicable,2006,ACTIVE,HEADOFFICE
1,1318,2007-12-31,1954-01-03,1989-08-28,1900-01-01,53,18,Vancouver,Executive,CEO,35,M,Male,Not Applicable,Not Applicable,2007,ACTIVE,HEADOFFICE

In [27]:
# hr_record table
# id will be genrated in database
df_test_record = data_df2.copy()
df_test_record = df_test_record[['recorddate_key', 'EmployeeID', 'orighiredate_key', 
                                'terminationdate_key', 'termreason_desc', 'STATUS']]

dbnames = {'recorddate_key' : 'record_date', 'EmployeeID' : 'employee_id',
            'orighiredate_key' : 'orighire_date', 'terminationdate_key' : 'termination_date', 
            'termreason_desc' : 'termreason_desc', 'STATUS' : 'status'}
df_test_record.rename(columns=dbnames, inplace=True)

In [28]:
df_test_record[:2]

,record_date,employee_id,orighire_date,termination_date,termreason_desc,status
0,2006-12-31,0,1989-08-28,1900-01-01,Not Applicable,ACTIVE
1,2007-12-31,1,1989-08-28,1900-01-01,Not Applicable,ACTIVE

In [29]:
# Fill the table
df_test_record.to_sql("hr_record", con=engine, index=False, if_exists='append')

713

In [30]:
# employee_stats table with dataframe
df_records_hr = pd.read_sql_table("hr_record", con=engine)
df_birth = pd.read_sql_table("employee", con=engine, columns=['id', 'birthday'])
df_birth.rename(columns={'id' : 'employee_id'}, inplace=True)
df_records_hr.rename(columns={'id' : 'record_id'}, inplace=True)
df_records = df_records_hr.merge(df_birth, how='left', on='employee_id')

In [31]:
df_records['age'] = df_records.apply(lambda x: x['record_date'].year  - x['birthday'].year, axis=1)
df_records['length_of_service'] = df_records.apply(lambda x: x['record_date'].year - x['orighire_date'].year, axis=1)

In [32]:
df_records

,record_id,record_date,employee_id,orighire_date,termination_date,termreason_desc,status,birthday,age,length_of_service
0,100307,2006-12-31,0,1989-08-28,1900-01-01,Not Applicable,ACTIVE,1954-01-03,52,17
1,100308,2007-12-31,1,1989-08-28,1900-01-01,Not Applicable,ACTIVE,1954-01-03,53,18
2,100309,2008-12-31,2,1989-08-28,1900-01-01,Not Applicable,ACTIVE,1954-01-03,54,19
3,100310,2009-12-31,3,1989-08-28,1900-01-01,Not Applicable,ACTIVE,1954-01-03,55,20
4,100311,2010-12-31,4,1989-08-28,1900-01-01,Not Applicable,ACTIVE,1954-01-03,56,21
...,...,...,...,...,...,...,...,...,...,...
1042708,1143015,2015-12-01,1042708,2013-08-19,2015-12-30,Layoff,TERMINATED,1994-05-28,21,2
1042709,1143016,2013-08-01,1042709,2013-08-27,2013-08-30,Resignaton,TERMINATED,1994-06-13,19,0
1042710,1143017,2015-12-01,1042710,2013-09-15,2015-12-30,Layoff,TERMINATED,1994-07-18,21,2
1042711,1143018,2013-12-01,1042711,2013-10-09,2013-12-31,Resignaton,TERMINATED,1994-09-02,19,0
1042712,1143019,2014-12-01,1042712,2013-11-24,2014-12-30,Layoff,TERMINATED,1994-11-28,20,1

In [33]:
df_records.drop(columns=['record_date', 'orighire_date', 'termination_date', 'termreason_desc', 'birthday', 'status'], inplace=True)

In [34]:
df_records.to_sql("employee_stats", con=engine, index=False, if_exists='append')

713

In [35]:
# generate data for project
def generate_projects(N):
    df_project = pd.DataFrame(columns=['name', 'start_date', 'end_date'])
    fake = Faker()
    for i in range(N):
        df_project.loc[len(df_project.index)] = [fake.slug(), pd.to_datetime(fake.date_time_this_decade()), 
                                                pd.to_datetime(fake.date_time_this_decade())]
    return df_project

In [36]:
df_project = generate_projects(10000)

In [149]:
df_project[:2]

                name          start_date            end_date
0   card-they-accept 2021-01-16 12:51:03 2021-06-22 10:19:02
1  structure-western 2021-11-07 03:55:32 2020-11-29 16:47:29

In [37]:
# fill project table
df_project.to_sql("project", con=engine, index=False, if_exists='append')

1000

In [38]:
# project_team table
# generate teams
df_projects_id = pd.read_sql_table("project", con=engine, columns=['id'])
df_eployee_id = pd.read_sql_table("employee", con=engine, columns=['id'])
df_team = pd.DataFrame(columns=['project_id', 'employee_id'])
for proj in df_projects_id ['id']:
    sample = df_eployee_id['id'].sample(n = 5)
    for i in range(5):
        df_team.loc[len(df_team.index)] = [proj, sample.values[i]]

In [39]:
# fill project_team table
df_team.to_sql("project_team", con=engine, index=False, if_exists='append')

1000

## Close connection

In [40]:
conn.close()
print("Connection closed")

Connection closed

## Unused code

In [ ]:
with Session(engine) as session:
    result = session.execute(sal.select(HRRecord.id))
records = []
for row in result:
    records.append(row[0])

for id in records:
    # get id of employee
    with Session(engine) as session:
        curr_rec = session.execute(sal.select(HRRecord).where(HRRecord.id==id)).scalar()
        curr_birth = session.execute(sal.select(Employee.birthday).where(Employee.id==curr_rec.employee_id)).scalar()
    print("Adding stats for ", curr_rec.employee_id)

    # count stats
    with Session(engine) as session:
        curr_birth = session.execute(sal.select(HRRecord.record_date).where(HRRecord.id==id)).scalar()
    curr_servlen = curr_rec.record_date.year - curr_rec.orighire_date.year
    curr_age = curr_rec.record_date.year  - curr_birth.year

    # add stats
    stat = EmployeeStats(record_id=id, employee_id=curr_rec.employee_id, 
                age=curr_age, length_of_service=curr_servlen)
    session.add(stat)
    session.commit()
print("Stats added")

i = 0
empl1 = Employee(id=df_test_employee['id'][i], 
        birthday=df_test_employee['birthday'][i], 
        gender=df_test_employee['gender'][i], 
        city_name=df_test_employee['city_name'][i], 
        department_name=df_test_employee['department_name'][i], 
        job_title=df_test_employee['job_title'][i],
        store_name=df_test_employee['store_name'][i], 
        business_unit=df_test_employee['business_unit'][i])
empl1